#include"Windows.h"
struct WeChatMeassage
{
	char namebuffer[127];
	char accoutbuffer[127];
	char wechatmobile[127];
	char webchatkey[32];
	char KeyAddress[124];
	char KeyHexBuffer[64 + 1];
};
typedef  struct {
    char  version[24];//版本信息

    DWORD account_offset;//微信号偏移
    DWORD  mobile_offset;//手机号偏移
    ULONGLONG  key_offset;//key偏移
}  WeChatVersionInfo;

WeChatVersionInfo  wechat_version_info[36] = {
     {"3.9.8.15",   0X3DFCA50,  0X3DFC458,  0X3DFCA10},//除了第一行其他数据都是随机生成的 需要你自己填写
     {"3.2.1.154",   328122328,  328123056,  328123020},
     {"3.3.0.115",   31323744,  31324472,  31324436},
     {"3.3.0.84",    31315592,  31316320,  31316284},
     {"3.3.0.93",   31323744,  31324472,  31324436},
     {"3.3.5.34",   30603408,  30604120,  30604100},
     {"3.3.5.42",    30603392,  30604120,  30604084},
     {"3.3.5.46",    30578752,  30579480,  30579444},
     {"3.4.0.37",    31608496,  31609224,  31609188},
     {"3.4.0.38",    31604424,  31605152,  31605116},
     {"3.4.0.50",   31688880,  31689608,  31689572},
     {"3.4.0.54",   31701248,  31700920,  31701924},
     {"3.4.5.27",   32134168,  32134896,  32134860},
     {"3.4.5.45",   32147392,  32147064,  32148084},
     {"3.5.0.20",   35494864,  35494536,  35495556},
     {"3.5.0.29",   35508360,  35508032,  35509052},
     {  "示范"  ,    1      ,        2,           3}

};